Before Change

```
 # module.usw1_appliance-vyoss.module.gcp_ncc_appliance_spoke_vyos["spoke-lan-vyos-transit-1ncc-usw1"].google_network_connectivity_spoke.ncc_spoke must be replaced
-/+ resource "google_network_connectivity_spoke" "ncc_spoke" {
      ~ create_time      = "2024-12-07T16:47:44.381551298Z" -> (known after apply)
      ~ hub              = "projects/rteller-demo-hst-e265-aaaa/locations/global/hubs/hub-lan-1ncc-gbl0" -> "hub-lan-1ncc-gbl0"
      ~ id               = "projects/rteller-demo-hst-e265-aaaa/locations/us-west1/spokes/spoke-lan-vyos-transit-1ncc-usw1" -> (known after apply)
      - labels           = {} -> null
      ~ name             = "projects/rteller-demo-hst-e265-aaaa/locations/us-west1/spokes/spoke-lan-vyos-transit-1ncc-usw1" -> "spoke-lan-vyos-transit-1ncc-usw1"
      ~ state            = "ACTIVE" -> (known after apply)
      ~ unique_id        = "c79f20f2-ae8d-46e0-98a5-addef5c406b6" -> (known after apply)
      ~ update_time      = "2024-12-07T16:56:41.257471932Z" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ linked_router_appliance_instances {
          - include_import_ranges      = [] -> null
            # (1 unchanged attribute hidden)

          - instances { # forces replacement
              - ip_address      = "172.16.0.23" -> null # forces replacement
              - virtual_machine = "https://www.googleapis.com/compute/v1/projects/rteller-demo-hst-e265-aaaa/zones/us-west1-a/instances/lan-vyos-transit-usw1-1ncc-01" -> null # forces replacement
            }

            # (1 unchanged block hidden)
        }
    }
```

After Change

```
  # module.usw1_appliance-vyoss.module.gcp_ncc_appliance_spoke_vyos["spoke-lan-vyos-transit-1ncc-usw1"].google_network_connectivity_spoke.ncc_spoke will be updated in-place      
  ~ resource "google_network_connectivity_spoke" "ncc_spoke" {
        id               = "projects/rteller-demo-hst-e265-aaaa/locations/us-west1/spokes/spoke-lan-vyos-transit-1ncc-usw1"
        name             = "projects/rteller-demo-hst-e265-aaaa/locations/us-west1/spokes/spoke-lan-vyos-transit-1ncc-usw1"
        # (11 unchanged attributes hidden)

      ~ linked_router_appliance_instances {
            # (2 unchanged attributes hidden)

          - instances {
              - ip_address      = "172.16.0.23" -> null
              - virtual_machine = "https://www.googleapis.com/compute/v1/projects/rteller-demo-hst-e265-aaaa/zones/us-west1-a/instances/lan-vyos-transit-usw1-1ncc-01" -> null    
            }

            # (1 unchanged block hidden)
        }
    }
```